CodeSystem: CodeSystem32
Id: CodeSystem32
Title: "その他の判定区分"
* ^meta.versionId = "7"
* ^meta.lastUpdated = "2021-07-01T07:35:16.428+00:00"
* ^meta.source = "#G9v8NOzCz60Cmx53"
* ^url = "https://igs.healthdataworks.net/JP-eCheckup/CodeSystem-CodeSystem32.html"
* ^status = #draft
* ^valueSet = "https://igs.healthdataworks.net/JP-eCheckup/ValueSet-OhterAssesmentCategories.html"
* ^content = #complete
* #2.16.840.1.113883.2.2.1.5020.2.1 "判定区分コード タイプA" "1:異常なし、2:差し支えなし、3:生活様式改善し経過観察、4:要治療、5:要精査、6:治療中"
* #2.16.840.1.113883.2.2.1.5020.2.2 "判定区分コード タイプB" "1:異常なし、2:心配なし、3:要注意、4:経過観察、5:要再検査、6:要精密検査、7:要治療、8:治療中、9:その他"
* #2.16.840.1.113883.2.2.1.5020.2.3 "判定区分コード タイプC" "1:今回の検査では異常ありません。2:特に問題ありませんが、年１回の検査をお勧めします。3:再検査および定期検査を要します。4:精密検査を要します。5:治療を必要とします。6:治療を継続してください。"
* #2.16.840.1.113883.2.2.1.5020.2.4 "判定区分コード タイプD" "1:異常なし、2:僅かに異常を認めるも日常生活に差し支えなし、3:食事等日常生活に注意し経過観察を行う、4:薬、注射による治療、或いは入院を必要とする、5:再検査、精密検査を行う"
* #2.16.840.1.113883.2.2.1.5020.2.5 "判定区分コード タイプE" "1:正常、2:要注意、3:要観察、4:要治療、5:治療中、6:要精検"