CodeSystem: CodeSystem31
Id: CodeSystem31
Title: "公開された判定基準"
* ^meta.versionId = "7"
* ^meta.lastUpdated = "2021-07-01T07:35:00.853+00:00"
* ^meta.source = "#WbRLbUQHKb5Ee4Mz"
* ^url = "https://igs.healthdataworks.net/JP-eCheckup/CodeSystem-CodeSystem31.html"
* ^status = #draft
* ^valueSet = "https://igs.healthdataworks.net/JP-eCheckup/ValueSet-PublishedCriteria.html"
* ^content = #complete
* #2.16.840.1.113883.2.2.1.6.5020.1.1 "判定区分（人間ドック学会2003）" "A:異常なし、B:軽度異常あるも日常生活に支障なし、C:軽度異常あり生活習慣改善、又は経過観察を要す、D1:要医療、D2:要精密検査、D:要医療または要精密検査、E:現在治療中"
* #2.16.840.1.113883.2.2.1.6.5020.1.2 "判定区分（人間ドック学会2008）" "A:異常なし、B:動機付け支援、C1:積極的支援、C2:積極的支援、D:受診勧奨、D1:要治療、D2:要精密検査、E:治療中"
* #2.16.840.1.113883.2.2.1.6.5020.1.3 "判定区分（人間ドック学会2012）" "A:異常なし、B:軽度異常、C:要経過観察・生活改善、D1:要治療、D2:要精検、E:治療中"
* #2.16.840.1.113883.2.2.1.6.5020.1.4 "指導区分（協会けんぽ）" "1:この検査の範囲では異常ありません。2:わずかに基準範囲をはずれていますが、日常生活に差し支えありません。3:日常生活に注意を要し、経過の観察を必要とします。4:治療を必要とします。5:精密検査を必要とします。6:治療中"
* #2.16.840.1.113883.2.2.1.6.5020.1.5 "（財）日本予防医学協会" "A1:異常なし、A2:有所見健康、A3:生活注意、B1:要経過観察、B2:経過観察中、G1:要再検査、G2:要精密検査、C1:要医療（要治療）、C2:加療中（治療中）"